dariocastillo11/SNAKE---LPC1769/src/dino_game.c
/**
 * @file dino_game.c
 * @brief Implementación del mini-juego "Dinosaurio" usando LCD I2C + DAC melodías.
 *
 * Hardware:
 * - P0.4:  Botón de salto (GPIO input con pull-up)
 * - P0.27: SDA0 del LCD I2C
 * - P0.28: SCL0 del LCD I2C
 * - P0.26: Salida DAC para melodías (usado por melodias_dac.c)
 *
 * Timers utilizados:
 * - TIMER0: Sistema de melodías DAC (melodias_dac.c) - Generación de audio
 * - TIMER1: Sistema de melodías DAC (melodias_dac.c) - Contador de tiempo
 * - TIMER2: Motor del juego (este archivo) - Ticks de 50ms (20 Hz)
 *
 * Arquitectura:
 * - TIMER2_IRQHandler setea un flag (game_tick_flag) cada 50ms
 * - El main loop procesa el tick: actualiza física, detección, dibuja
 * - Las funciones I2C/LCD se llaman SOLO desde el main loop (nunca desde ISR)
 * - Las melodías se actualizan con melodias_actualizar() (no bloqueante)
 *
 * @date Noviembre 2025
 */

#include "dino_game.h"
#include "lcd_i2c.h"
#include "melodias_dac.h"  // Sistema de melodías
#include "bluetooth_uart.h" // Comandos Bluetooth
#include "LPC17xx.h"
#include "lpc17xx_pinsel.h"
#include "lpc17xx_timer.h"

#include <stdint.h>
#include <string.h>

/* ========================== CONFIGURACIÓN ================================= */

/* Pin del botón de salto */
#define DINO_BUTTON_PORT 0
#define DINO_BUTTON_PIN  4

/* Dimensiones del área de juego en caracteres LCD (20x4) */
#define DINO_COLS 20          // Ancho del LCD en caracteres
#define DINO_ROW_GROUND 3     // Fila inferior (0=marcadores, 1-3=juego)

/* Dimensiones del sprite del dinosaurio */
#define DINO_WIDTH 1          // Ancho en caracteres (optimizado)
#define DINO_HEIGHT 2         // Alto en caracteres (2 filas)

/* Configuración de timing del juego */
#define TICKS_PER_SEC 20      // Frecuencia de actualización (20 Hz)
#define TICK_MS 50            // Período de tick (50ms = 1000ms/20)

/* Configuración de dificultad del juego */
#define INIT_MOVE_INTERVAL 6       // Intervalo inicial entre movimientos (ticks)
#define MIN_MOVE_INTERVAL 2        // Intervalo mínimo (velocidad máxima)
#define BASE_SPAWN_THRESHOLD 40    // Umbral inicial de spawn de obstáculos (0-255)
#define MAX_SPAWN_THRESHOLD 80     // Umbral máximo de spawn

/* ========================== VARIABLES DE ESTADO ========================== */

/* Flag de tick del timer (seteado por TIMER2_IRQHandler cada 50ms) */
static volatile uint8_t game_tick_flag = 0;

/* Array de obstáculos (0 = vacío, 1-3 = tamaño del obstáculo) */
static uint8_t obstacles[DINO_COLS];

/* Posición del dinosaurio */
static uint8_t dino_col = 2;          /* Columna fija del dinosaurio */
static int8_t dino_vpos = 0;          /* Posición vertical (0=suelo, >0=aire) */
static int8_t dino_velocity = 0;      /* Velocidad vertical (sin usar actualmente) */

/* Generación de obstáculos */
static uint8_t spawn_counter = 0;
static uint32_t prng = 0xACE1u;       /* Semilla para PRNG (LFSR de 16 bits) */
static uint8_t last_obstacle_pos = 0; /* Posición del último obstáculo generado */

/* Estado del juego */
static uint8_t game_over = 0;         /* 1 = juego terminado */
static uint8_t game_started = 0;      /* 1 = juego iniciado por el usuario */
static uint32_t score = 0;            /* Puntuación actual */
static uint32_t ticks_since_start = 0; /* Ticks desde inicio del juego */

/* Control del botón */
static uint8_t button_held = 0;       /* 1 = botón presionado */
static uint8_t last_button_state = 0; /* Estado anterior del botón (0=no presionado, activo BAJO) */
static uint8_t debounce_cnt = 0;      /* Contador de debounce */
static uint8_t jump_requested = 0;    /* 1 = salto pendiente */
static uint8_t last_held = 0;         /* Último estado confirmado de button_held (para edge detection) */

/* Ajuste dinámico de dificultad */
static uint8_t move_interval = INIT_MOVE_INTERVAL; /* Ticks entre movimientos */
static uint8_t move_counter = 0;                    /* Contador para move_interval */
static uint8_t spawn_threshold = BASE_SPAWN_THRESHOLD; /* Umbral de spawn (0-255) */

/* Animación del dinosaurio */
static int current_frame = 0;        /* Frame actual de animación (0 o 1) */
static int animation_counter = 0;    /* Contador para velocidad de animación */

/* ========================== DECLARACIONES FORWARD ======================== */

static void update_dino_animation(void);
static void draw_score_display(void);
static void draw_game_screen(void);

/* ========================== SPRITES Y ANIMACIÓN ========================== */

/**
 * Frames de animación del dinosaurio caminando.
 *
 * Cada frame es una matriz 2x2 de caracteres:
 * - Fila 0: Parte superior del dinosaurio (cabeza)
 * - Fila 1: Parte inferior del dinosaurio (patas)
 *
 * Frame 0: 'D' arriba + 'A' abajo (pata izquierda adelante)
 * Frame 1: 'D' arriba + 'I' abajo (pata derecha adelante)
 *
 * La alternancia entre frames crea efecto de caminata.
 */
static const char walking_frames[2][2][2] = {
    {   /* Frame 0 - D + A (caminando) */
        {'D', 'A'},  /* columna: D arriba, A abajo */
        {' ', ' '}   /* columna derecha: vacía (ancho de 1 char) */
    },
    {   /* Frame 1 - D + I (caminando) */
        {'D', 'I'},  /* columna: D arriba, I abajo */
        {' ', ' '}   /* columna derecha: vacía (ancho de 1 char) */
    }
};

/* ========================== FUNCIONES AUXILIARES ========================= */

/**
 * @brief Lee el estado del botón desde el GPIO o Bluetooth.
 *
 * El botón físico está conectado a GND con pull-up interno (activo BAJO):
 * - Pin LOW (0) = presionado → retorna 1
 * - Pin HIGH (1) = no presionado → retorna 0
 *
 * También verifica si hay comando 'B' desde Bluetooth.
 *
 * @return 1 si está presionado (físico o Bluetooth), 0 si no
 */
static int read_button(void) {
    /* Leer botón físico P0.4 */
    int physical = (LPC_GPIO0->FIOPIN & (1u << DINO_BUTTON_PIN)) ? 0 : 1;
    
    /* Leer comando Bluetooth */
    int bt_button = bt_get_button_command();
    
    /* Si cualquiera está presionado, retornar 1 */
    if (bt_button) {
        bt_clear_button_command();  // Limpiar después de leer
        return 1;
    }
    
    return physical;
}

/**
 * @brief Generador de números pseudo-aleatorios (PRNG) usando LFSR de 16 bits.
 *
 * Implementa un Linear Feedback Shift Register para generar secuencia
 * pseudo-aleatoria. Usado para spawning de obstáculos.
 *
 * @return Número pseudo-aleatorio de 16 bits
 */
static uint16_t lfsr16(void) {
    uint16_t l = (uint16_t)prng;
    uint16_t lsb = l & 1u;
    l >>= 1;
    if (lsb) l ^= 0xB400u;
    prng = l;
    return l;
}

/**
 * @brief Dibuja el frame completo del juego en el LCD.
 *
 * Renderiza fila por fila (filas 1-3, la 0 es para marcadores):
 * - Dinosaurio en su posición con altura de salto calculada
 * - Obstáculos en la fila inferior (pueden ser múltiples '#' consecutivos)
 *
 * Optimizado para evitar parpadeo usando dibujo directo sin borrado previo.
 */
static void draw_game_screen(void) {
    /* Calcular altura del salto del dinosaurio
       Altura ajustada dinámicamente según la duración del salto actual
       y la velocidad de caída */
    int height = 0;

    /* Umbrales más conservadores para evitar parpadeos */
    if (dino_vpos >= 10) {
        height = 2;      /* muy alto */
    } else if (dino_vpos >= 5) {
        height = 1;      /* medio */
    } else {
        height = 0;      /* en el suelo */
    }

    int dino_bottom_row = DINO_ROW_GROUND - height;

    /* Dibujar fila por fila (filas 1-3, la 0 es para marcadores) */
    for (int row = 1; row <= DINO_ROW_GROUND; row++) {
        lcd_setCursor(row, 0);

        for (int col = 0; col < DINO_COLS; col++) {
            char ch = ' '; /* por defecto vacío */

            /* ¿Hay dinosaurio en esta posición? (ahora solo 1 columna) */
            if (col == dino_col) {
                /* Verificar si el dino ocupa esta fila */
                if (row >= dino_bottom_row - 1 && row <= dino_bottom_row) {
                    /* Índice de fila relativo al sprite (0=arriba, 1=abajo) */
                    int sprite_row = row - (dino_bottom_row - 1);
                    /* Solo usamos la primera columna del frame (índice 0) */
                    ch = walking_frames[current_frame][0][sprite_row];
                }
            }

            /* Si no hay dino, verificar obstáculo en fila inferior
               Los obstáculos ahora pueden ser múltiples '#' consecutivos */
            if (ch == ' ' && row == DINO_ROW_GROUND) {
                /* Verificar si esta columna tiene obstáculo */
                if (obstacles[col] > 0) {
                    ch = '#';
                } else {
                    /* Verificar si es parte de un obstáculo que empezó antes */
                    for (int back = 1; back < 3; back++) {
                        int check_col = col - back;
                        if (check_col >= 0 && obstacles[check_col] > back) {
                            ch = '#';
                            break;
                        }
                    }
                }
            }

            lcd_writeDataByte(ch);
        }
    }
}

/**
 * @brief Comprueba si hay colisión entre el dinosaurio y un obstáculo.
 *
 * Detecta colisión cuando:
 * 1. El dinosaurio está cerca del suelo (dino_vpos bajo)
 * 2. Hay un obstáculo en la columna del dinosaurio
 *
 * El umbral de altura segura se ajusta dinámicamente según la velocidad
 * del juego para evitar falsas colisiones durante saltos rápidos.
 *
 * Si detecta colisión:
 * - Setea game_over = 1
 * - Reproduce melodía de game over
 */
static void check_collision(void) {
    /* Colisión solo cuando el dinosaurio está en el suelo (no saltando)
       y hay un obstáculo en su columna (ahora solo ocupa 1 columna). */

    /* Umbral dinámico según velocidad del juego:
       - Velocidad lenta: necesita estar muy bajo (> 4)
       - Velocidad rápida: puede estar un poco más alto (> 2)
       Esto evita colisiones falsas cuando acelera */
    int safe_height = 2 + (move_interval / 2); /* 2 a 5 según velocidad */

    if (dino_vpos > safe_height) {
        return; /* saltó sobre el obstáculo */
    }

