dariocastillo11/SNAKE---LPC1769/src/dino_game.c
    /* Verificar si hay obstáculo en la columna del dinosaurio */
    if (obstacles[dino_col]) {
        game_over = 1;
        /* Detener música de fondo antes de reproducir melodía de game over */
        melodias_detener();
        melodias_iniciar(melodia_game_over);
    }
}

/**
 * @brief Resetea el estado del juego a valores iniciales.
 *
 * Limpia:
 * - Array de obstáculos
 * - Posición y velocidad del dinosaurio
 * - Flags de control del botón
 * - Puntuación y tiempo
 * - Parámetros de dificultad (velocidad y spawn rate)
 * - Estado de animación
 */
void dino_game_restart(void) {
    memset(obstacles, 0, sizeof(obstacles));
    dino_vpos = 0;
    dino_velocity = 0;
    button_held = 0;
    jump_requested = 0;
    last_button_state = 0;  // 0 = no presionado (activo BAJO)
    debounce_cnt = 0;
    spawn_counter = 0;
    game_over = 0;
    game_started = 0;  // Resetear para que pida "presiona para jugar" nuevamente
    score = 0;
    ticks_since_start = 0;
    current_frame = 0;
    animation_counter = 0;
    move_interval = INIT_MOVE_INTERVAL;
    move_counter = 0;
    spawn_threshold = BASE_SPAWN_THRESHOLD;
    last_obstacle_pos = 0;
    /* Asegurar que la detección de flancos reinicie correctamente */
    last_held = 0;
}

/**
 * @brief Actualiza la física del juego en cada tick.
 *
 * Procesamiento en orden:
 * 1. Actualiza física del salto (caída gravitacional)
 * 2. Mueve obstáculos hacia la izquierda según move_interval
 * 3. Genera nuevos obstáculos aleatoriamente (tamaño 1-3 caracteres)
 * 4. Ajusta dificultad dinámicamente (velocidad y spawn rate)
 * 5. Detecta colisiones
 * 6. Actualiza puntuación al pasar obstáculos
 *
 * La velocidad de caída se adapta a move_interval para mantener
 * jugabilidad consistente a diferentes velocidades de juego.
 */
static void game_tick_update(void) {
    if (game_over) return;

    /* Contador global de ticks (para ajustar dificultad con el tiempo) */
    ticks_since_start++;

    /* Manejo de salto con velocidad adaptativa:
       - A velocidad lenta: cae 1 tick por frame (suave)
       - A velocidad rápida: cae 2 ticks por frame (rápido)
       Esto hace que la caída sea proporcional a la velocidad del juego */
    if (dino_vpos > 0) {
        /* Calcular velocidad de caída según move_interval:
           - move_interval 6 (lento): decrement = 1
           - move_interval 4 (medio): decrement = 1
           - move_interval 2 (rápido): decrement = 2 */
        int fall_speed = (move_interval <= 3) ? 2 : 1;
        dino_vpos -= fall_speed;
        if (dino_vpos < 0) dino_vpos = 0; /* no bajar de 0 */
    }

    /* Incrementar contador de movimiento y mover obstáculos sólo cuando
       alcanzamos el intervalo. Esto permite ajustar velocidad inicial más
       lenta y aumentarla con el tiempo. */
    move_counter++;
    if (move_counter < move_interval) {
        return; /* no mover obstáculos aún */
    }
    move_counter = 0;
    /* Mover obstáculos hacia la izquierda */
    /* Guardar si había un obstáculo en la columna del dino antes del movimiento
       para poder contar cuando haya pasado con éxito. */
    uint8_t was_at_dino = obstacles[dino_col];
    for (int i = 0; i < DINO_COLS - 1; i++) {
        obstacles[i] = obstacles[i + 1];
    }

    /* Actualizar posición del último obstáculo (se mueve a la izquierda) */
    if (last_obstacle_pos > 0) {
        last_obstacle_pos--;
    }

    /* Generar spawn usando un umbral sobre 0..255; spawn_threshold pequeño al
       inicio provoca pocos obstáculos, y lo aumentamos con el tiempo.
       Ahora los obstáculos pueden tener tamaño 1, 2 o 3 caracteres.
       IMPORTANTE: Solo generar si hay al menos 4 espacios desde el último obstáculo */
    uint16_t r = lfsr16() & 0xFFu;
    if (r < spawn_threshold && last_obstacle_pos == 0) {
        /* Generar tamaño aleatorio del obstáculo: 1, 2 o 3 */
        uint8_t size = (lfsr16() % 3) + 1; /* 1, 2 o 3 */
        obstacles[DINO_COLS - 1] = size;
        /* Marcar que generamos obstáculo: mínimo 4 espacios de separación
           (3 vacíos + 1 del obstáculo) */
        last_obstacle_pos = 4 + size; /* separación + tamaño del obstáculo */
    } else {
        obstacles[DINO_COLS - 1] = 0;
    }

     /* Ajustar dificultad dinámicamente según puntuación (cada obstáculo pasado).
         - move_interval baja gradualmente (obstáculos se mueven más rápido).
         - spawn_threshold sube gradualmente (más probabilidad de spawn).
         Esto produce un aumento suave de la dificultad conforme avanza. */
     /* Cada 5 puntos, aumentar velocidad */
     int speed_level = score / 5;
     int new_move = (int)INIT_MOVE_INTERVAL - speed_level;
     if (new_move < MIN_MOVE_INTERVAL) new_move = MIN_MOVE_INTERVAL;
     move_interval = (uint8_t)new_move;

     /* Cada 3 puntos, aumentar probabilidad de spawn; limitar a MAX_SPAWN_THRESHOLD */
     int spawn_level = score / 3;
     int new_spawn = (int)BASE_SPAWN_THRESHOLD + (spawn_level * 2);
     if (new_spawn > MAX_SPAWN_THRESHOLD) new_spawn = MAX_SPAWN_THRESHOLD;
     spawn_threshold = (uint8_t)new_spawn;

    check_collision();

    /* Si antes había un obstáculo en la columna del dino y ahora
       no está ocupada -> +1 punto (pasó correctamente). */
    int now_at_dino = obstacles[dino_col];
    if (was_at_dino && !now_at_dino && !game_over) {
        score++;
    }
}

/**
 * @brief Inicializa TIMER2 para generar ticks de juego cada 50ms.
 *
 * Configura TIMER2 en modo contador con prescaler de 1ms y match en 50ms.
 * Genera interrupción periódica que setea game_tick_flag para actualización
 * del juego en el main loop.
 */
static void timer2_init(void) {
    TIM_TIMERCFG_Type timer_config;
    TIM_MATCHCFG_Type match_config;

    /* Configurar prescaler para base de tiempo de 1ms */
    timer_config.prescaleOption = TIM_USVAL;
    timer_config.prescaleValue = 1000; /* 1ms base time */

    TIM_Init(LPC_TIM2, TIM_TIMER_MODE, &timer_config);

    /* Configurar match para período de tick del juego (50ms) */
    match_config.matchChannel = TIM_MATCH_CHANNEL_0;
    match_config.intOnMatch = ENABLE;        /* Generar interrupción */
    match_config.resetOnMatch = ENABLE;      /* Reset automático en match */
    match_config.stopOnMatch = DISABLE;      /* Continuar después del match */
    match_config.extMatchOutputType = TIM_NOTHING;
    match_config.matchValue = TICK_MS;       /* 50ms tick rate */

    TIM_ConfigMatch(LPC_TIM2, &match_config);

    /* Habilitar interrupción TIMER2 en NVIC */
    NVIC_EnableIRQ(TIMER2_IRQn);

    /* Iniciar TIMER2 */
    TIM_Cmd(LPC_TIM2, ENABLE);
}

/**
 * @brief Handler de interrupción de TIMER2.
 *
 * Se ejecuta cada 50ms (20 Hz) cuando TIMER2 alcanza el valor de match.
 * Setea la bandera game_tick_flag para indicar al main loop que debe
 * procesar un tick de juego. Mantiene la ISR lo más breve posible.
 */
void TIMER2_IRQHandler(void) {
    if (TIM_GetIntStatus(LPC_TIM2, TIM_MR0_INT)) {
        game_tick_flag = 1;
        TIM_ClearIntPending(LPC_TIM2, TIM_MR0_INT);
    }
}

/**
 * @brief Inicializa el hardware necesario para el juego del dinosaurio.
 *
 * Configura:
 * - P0.4 como GPIO input con pull-up para el botón de salto
 * - TIMER2 para generar ticks de juego cada 50ms
 * - Estado inicial del juego
 * - Pantalla inicial en LCD
 *
 * Nota: Deshabilita TIMER0_IRQn para evitar conflictos con otras ISRs
 * que puedan escribir en el LCD simultáneamente.
 */
void dino_game_init(void) {
    /* NOTA: P0.4 YA está configurado como GPIO input con PULL-UP en main.c
       No reconfigurar aquí para no sobrescribir la configuración global */
    
    /* Asegurar que P0.4 es entrada (sin tocar el pinMode) */
    LPC_GPIO0->FIODIR &= ~(1u << DINO_BUTTON_PIN);

    /* Deshabilitar IRQ de TIMER2 por si estaba activo */
    NVIC_DisableIRQ(TIMER2_IRQn);
    
