dariocastillo11/SNAKE---LPC1769/src/dino_game.c
    /* Limpiar flag de tick pendiente */
    game_tick_flag = 0;
    
    /* Iniciar TIMER2 para ticks del juego (TIM_Init ya resetea el timer) */
    timer2_init();

    /* Resetear estado del juego */
    dino_game_restart();

    /* Iniciar juego inmediatamente (como Snake) */
    game_started = 1;

    /* SIEMPRE dibujar pantalla inicial limpia */
    lcd_borrarPantalla();
    draw_score_display();
    draw_game_screen();

    /* NOTA: TIMER0_IRQn debe estar HABILITADO para que funcione el DAC/audio.
       El sistema de melodías no interfiere con el LCD porque usa DMA y
       no hace llamadas bloqueantes desde la ISR. */
}
/**
 * @brief Debounce del botón y actualización de estado.
 *
 * Implementa debounce simple:
 * - Detecta cambios de estado del botón
 * - Espera 2 ticks de estabilidad antes de confirmar
 * - Setea jump_requested inmediatamente al presionar (para respuesta rápida)
 * - Actualiza button_held después de confirmar estado estable
 */
static void update_button_state(void) {
    int raw = read_button();
    int pressed = (raw == 1);  // Botón activo BAJO: 1 = presionado

    if (pressed != last_button_state) {
        debounce_cnt = 0;
        last_button_state = pressed;

        /* Si cambió a presionado, marcar solicitud de salto inmediatamente */
        if (pressed) {
            jump_requested = 1;
        }
        return;
    }

    if (debounce_cnt < 3) {
        debounce_cnt++;
        return;
    }

    /* Estado estable: actualizar button_held */
    button_held = pressed ? 1 : 0;
}

/**
 * @brief Detecta flanco de pulsación del botón (edge detection).
 *
 * Detecta transición de no presionado → presionado (rising edge).
 * Usado para iniciar juego y reiniciar después de game over.
 *
 * @return 1 si detectó flanco ascendente, 0 en caso contrario
 */
static int button_pressed_edge(void) {
    int edge = 0;

    if (button_held && !last_held) {
        edge = 1; /* flanco ascendente */
    }

    last_held = button_held;
    return edge;
}

/**
 * @brief Dibuja los marcadores en la fila superior del LCD (fila 0).
 *
 * Muestra:
 * - Izquierda: "DINO" (identificador del juego)
 * - Centro: Tiempo transcurrido en segundos (formato XXX)
 * - Derecha: Puntuación actual (formato XXX)
 *
 * Actualizado en cada frame del juego.
 */
static void draw_score_display(void) {
    /* Mostrar etiqueta DINO en esquina superior izquierda */
    lcd_setCursor(0, 0);
    lcd_escribir("DINO");

    /* Mostrar tiempo transcurrido (segundos) en el centro */
    int time_s = (int)(ticks_since_start / TICKS_PER_SEC);
    char time_s_buf[4];
    time_s_buf[3] = '\0';
    int ts = time_s;
    time_s_buf[2] = (ts % 10) + '0'; ts /= 10;
    time_s_buf[1] = (ts % 10) + '0'; ts /= 10;
    time_s_buf[0] = (ts % 10) + '0';
    int time_col = (DINO_COLS - 3) / 2;
    lcd_setCursor(0, time_col);
    lcd_escribir(time_s_buf);

    /* Mostrar puntuación en esquina superior derecha */
    char score_s[4];
    int sc = (int)score;
    score_s[3] = '\0';
    score_s[2] = (sc % 10) + '0'; sc /= 10;
    score_s[1] = (sc % 10) + '0'; sc /= 10;
    score_s[0] = (sc % 10) + '0';
    lcd_setCursor(0, DINO_COLS - 3);
    lcd_escribir(score_s);
}

/**
 * @brief Actualiza el juego si hay un tick pendiente del TIMER2.
 *
 * Esta función debe ser llamada periódicamente desde el main loop.
 * Procesa el tick del juego (física, colisiones, dibujo) solo cuando
 * TIMER2 ha generado una interrupción (game_tick_flag == 1).
 *
 * Flujo:
 * 1. Verificar si hay tick pendiente (por ISR o polling)
 * 2. Actualizar estado del botón
 * 3. Si no iniciado, esperar pulsación del usuario
 * 4. Si jugando: procesar salto, física, colisiones, animación, dibujo
 * 5. Si game over: mostrar mensaje y esperar reinicio
 */
void dino_game_run(void) {
    /* Polling adicional del flag de TIMER2 por si la ISR no se ejecuta.
       Esto previene que el juego se bloquee si NVIC está deshabilitado. */
    if (TIM_GetIntStatus(LPC_TIM2, TIM_MR0_INT)) {
        TIM_ClearIntPending(LPC_TIM2, TIM_MR0_INT);
        game_tick_flag = 1;
    }

    /* Salir si no hay tick pendiente */
    if (!game_tick_flag) return;
    game_tick_flag = 0;

    /* Actualizar estado del botón en cada tick */
    update_button_state();

    /* Si el juego aún no fue iniciado por el usuario, esperar pulsación para
       arrancar. Esto evita que el código borre la pantalla inesperadamente al
       arrancar y permite ver el texto inicial. */
    if (!game_started) {
        /* Usar jump_requested que se setea inmediatamente al detectar el botón */
        if (jump_requested) {
            game_started = 1;
            jump_requested = 0; /* Limpiar para evitar salto inmediato */
            dino_game_restart();

            /* Iniciar música de fondo en loop continuo */

            lcd_borrarPantalla();
            /* dibujar primer frame inmediatamente */
            draw_score_display();
            draw_game_screen();
        } else {
            return; /* esperar a que el usuario pulse */
        }
    }

    /* Leer botón: si se presiona y está en el suelo -> iniciar salto */
    if (!game_over) {
        /* Iniciar salto si hay solicitud pendiente y está en el suelo */
        if (jump_requested && dino_vpos == 0) {
            /* Duración del salto ajustada según velocidad del juego:
               - A velocidad inicial (move_interval=6): 20 ticks
               - A velocidad máxima (move_interval=2): 12 ticks
               Esto hace que el salto sea más rápido cuando el juego acelera */
            int jump_duration = 10 + (move_interval * 2); /* 12 a 22 ticks */
            dino_vpos = jump_duration;
            jump_requested = 0; /* Limpiar flag después de usar */

            // NO reproducir efecto (interrumpe música de fondo)
            // melodias_iniciar(melodia_salto);
        }

        /* Actualizar física del juego (movimiento, colisiones, spawns) */
        game_tick_update();

        /* Actualizar animación del dinosaurio (ciclo de frames) */
        update_dino_animation();

        /* Actualizar sistema de melodías DAC (no bloqueante) */
        melodias_actualizar();

        /* Dibujar todo el frame (optimizado, sin parpadeo) */
        draw_game_screen();
        draw_score_display();
    } else {
        /* Game over: mostrar mensaje y esperar botón para volver al menú */
        static uint8_t game_over_mostrado = 0;
        
        if (!game_over_mostrado) {
            lcd_setCursor(1, 0);
            lcd_escribir("  GAME OVER   ");
            lcd_setCursor(3, 0);
            lcd_escribir("Boton:Volver al menu");
            game_over_mostrado = 1;
        }
        
        if (button_pressed_edge()) {
            /* Usuario quiere volver al menú */
            game_over = 2;  // Estado especial: volver al menú solicitado
            game_over_mostrado = 0;
        }
    }
}

/**
 * @brief Actualiza la animación del dinosaurio (solo cuando está en el suelo).
 *
 * Alterna entre frame 0 y frame 1 cada 6 ticks (~300ms) para crear
 * efecto de caminata. La animación se pausa durante el salto.
 */
static void update_dino_animation(void) {
    /* Solo animar cuando está en el suelo */
    if (dino_vpos == 0) {
        animation_counter++;
        if (animation_counter >= 6) { /* Cambiar frame cada 6 ticks (~300ms) */
            current_frame = (current_frame + 1) % 2;
            animation_counter = 0;
        }
    }
}

/**
 * @brief Retorna el estado del juego
 * @return 0 = jugando, 1 = game over (pantalla mostrada), 2 = volver al menú
 */
uint8_t dino_game_is_over(void) {
    return game_over;
}
